### Yosys taargetting Xilinx
read_verilog ../../../source/ALU.v
read_verilog -DEMULATION ../../../source/ALU_wrapper.v

synth_xilinx -top ALU_wrapper -family xc7 -flatten
write_verilog  ALU_wrapper.v
stat
